Public Attributes | List of all members
API_MiscAppInfo Struct Reference
Project Operations
Miscellaneous information of the application. More...
#include <APIdefs_Environment.h>
 Public Attributes
char  | version [256]
Version string of the application.
char  | caption [256]
Caption of the application's main window.
Detailed Description
Miscellaneous information of the application.
Remarks
This structure contains version string and main window's caption of application. Call the ACAPI_ProjectOperation_GetMiscAppInfo function to get this data.
Member Data Documentation
◆ caption
 API_MiscAppInfo::caption
Caption of the application's main window.
◆ version
 API_MiscAppInfo::version
Version string of the application.